#include <iostream>
#include <cmath>
using namespace std;

int main(){
    // float and double
    double a = 100, b = 0.0001; // инициализация и установка значения переменных;
    // pow(x, y) - число x в степень y;
    cout << ( pow((a + b), 4) - ( pow(a, 2) * ( pow((a + 2 * b), 2 ) + 2 * b * b) ) )\
    / ( pow(b, 3) * ( 4 * a + b ) ); 
    // вычисление числителя и знаменятеля, а так же нахождение частного;

    /* Можно всё выражение сократить до  1 и получается что математический ответ не равен машинному;
    Это получается из-за того, что машина сначала вычисляет, и из-за недостатка памяти округляет значение, а не пытается упростить выражение*/
    return 0;
}
